src/InformationRegisters/кфкВходящиеСообщения/кфкВходящиеСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="f414732c-dcdc-4e52-825c-4b00cf4fa6e2">
  <name>кфкВходящиеСообщения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="40e13da9-a528-4570-883e-2c907efb0364">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="b7a46c86-21a3-43b1-9f53-d74a8fdccb2f">
    <name>Заголовки</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="40670889-dab8-4e97-83f0-746662cb9168">
    <name>ТелоСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="bd26b858-29df-4c6e-ba4a-75d5f9a60683">
    <name>Консьюмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="01079ff5-5033-46d9-af80-34e06690eabd">
    <name>Топик</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="674a635a-7c60-483a-aa26-18543e47cd4e">
    <name>Раздел</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f6fdbc5d-cd8b-4e9f-aef2-14902fcd3d2b">
    <name>Смещение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>32</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9504695b-0eb6-4677-b1ca-4823a52689aa">
    <name>КлючСообщения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="09c9dd9a-de2f-4730-a615-93cb72742570">
    <name>ДатаЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bfe7b38d-d429-4caa-b272-7de24cf9ca09">
    <name>ДатаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1cd89a-5799-49dd-be8b-f171cd5245a8">
    <name>ДатаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f591f9ce-cc6e-447d-9dbb-d8f97d14b471">
    <name>ДлОбработкиМС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b6867e51-27ef-412a-8310-5e541572a80d">
    <name>ТекстЖурнала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5ce30598-30ab-4cb8-8e33-07a80a4c3ca5">
    <name>КоличествоОбработок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d7d9478d-81b5-41b6-aef7-75804ffeda2f">
    <name>МеткаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <dimensions extendedConfigurationObject="f5651cfa-879f-4b36-a83a-fd15928fdcb5">
    <name>КлючЗаписи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions extendedConfigurationObject="111ca233-437e-423e-bb9a-fac72f0cf50c">
    <name>МеткаЗагрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>30</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/кфкСтатусыСообщений/кфкСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="90c87861-83c3-4174-81dd-550f291515d7">
  <name>кфкСтатусыСообщений</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e87ed46a-b4fe-41ad-a05b-c7d43a993d59">
    <name>Новое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4aa47c21-1293-47d6-b3ab-9d29a043b1dc">
    <name>Обработано</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82907498-6643-4090-a81d-dd1982638a68">
    <name>ОбработкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="bb65cb4f-750e-4084-b787-633ed9393166">
    <name>ОшибкаОбработки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="31aa5e8e-008e-4e64-bdea-a9307ad0bcc1">
    <name>Выгружено</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2aad9bb4-aca4-411a-8268-a2c8d7a9efe8">
    <name>ОшибкаВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b1566b75-70c6-497a-8ff6-bdaa91eddbbe">
    <name>ВыгрузкаОтменена</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

src/CommonModules/РС_кфкВходящиеСообщения_ММ/Module.bsl
Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ВТранзакции()
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкВходящиеСообщения. Модуль менеджера. СброситьСтатусОшибки()")
			.ДобавитьСерверныйТест("СброситьСтатусОшибки_ИзменяетТолькоОшибочныеСообщения",
				"СброситьСтатусОшибки(). Изменяет только сообщения с ошибкой обработки")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкВходящиеСообщения. Модуль менеджера. УдалитьСообщения()")
			.ДобавитьСерверныйТест("УдалитьСообщения_УдаляетПереданныеКлючи",
				"УдалитьСообщения(). Удаляет записи по массиву ключей")
			.ДобавитьСерверныйТест("УдалитьСообщения_УдаляетПоЗапросу",
				"УдалитьСообщения(). Удаляет записи по описанию запроса")
		.ДобавитьТестовыйНабор(
			"Регистр сведений кфкВходящиеСообщения. Модуль менеджера. ОчиститьРегистр()")
			.ДобавитьСерверныйТест("ОчиститьРегистр_УдаляетВсеСообщения",
				"ОчиститьРегистр(). Удаляет все записи");
	
КонецПроцедуры



Процедура СброситьСтатусОшибки_ИзменяетТолькоОшибочныеСообщения() Экспорт
	
	КлючОшибки = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.ОшибкаОбработки);
	КлючНового = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	Ключи = Новый Массив;
	Ключи.Добавить(КлючОшибки);
	Ключи.Добавить(КлючНового);
	РегистрыСведений.кфкВходящиеСообщения.СброситьСтатусОшибки(Ключи);
	
	ПроверитьСтатус(КлючОшибки, Перечисления.кфкСтатусыСообщений.Новое);
	ПроверитьСтатус(КлючНового, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура УдалитьСообщения_УдаляетПереданныеКлючи() Экспорт
	
	КлючКУдалению = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	СохраняемыйКлюч = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	Ключи = Новый Массив;
	Ключи.Добавить(КлючКУдалению);
	РегистрыСведений.кфкВходящиеСообщения.УдалитьСообщения(Ключи);
	
	ПроверитьОтсутствиеЗаписи(КлючКУдалению);
	ПроверитьСтатус(СохраняемыйКлюч, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура УдалитьСообщения_УдаляетПоЗапросу() Экспорт
	
	КлючКУдалению = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	СохраняемыйКлюч = ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	ОписаниеЗапроса = Новый Структура;
	ОписаниеЗапроса.Вставить("Текст",
		"ВЫБРАТЬ
		|	Входящие.КлючЗаписи,
		|	Входящие.ДатаЗагрузкиМС
		|ИЗ
		|	РегистрСведений.кфкВходящиеСообщения КАК Входящие
		|ГДЕ
		|	Входящие.КлючЗаписи = &КлючЗаписи");
	ОписаниеЗапроса.Вставить("Параметры",
		Новый Структура("КлючЗаписи", КлючКУдалению.КлючЗаписи));
	
	РегистрыСведений.кфкВходящиеСообщения.УдалитьСообщения(ОписаниеЗапроса);
	
	ПроверитьОтсутствиеЗаписи(КлючКУдалению);
	ПроверитьСтатус(СохраняемыйКлюч, Перечисления.кфкСтатусыСообщений.Новое);
	
КонецПроцедуры

Процедура ОчиститьРегистр_УдаляетВсеСообщения() Экспорт
	
	ДобавитьСообщение(Перечисления.кфкСтатусыСообщений.Новое);
	
	РегистрыСведений.кфкВходящиеСообщения.ОчиститьРегистр();
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.НеСодержитЗаписи();
	
КонецПроцедуры

Функция ДобавитьСообщение(Статус)
	
	КлючЗаписи = "yaxunit-" + Строка(Новый УникальныйИдентификатор);
	ДатаЗагрузкиМС = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Запись = РегистрыСведений.кфкВходящиеСообщения.СоздатьМенеджерЗаписи();
	Запись.КлючЗаписи = КлючЗаписи;
	Запись.ДатаЗагрузкиМС = ДатаЗагрузкиМС;
	Запись.Статус = Статус;
	Запись.Записать();
	
	ЗначенияКлюча = Новый Структура("КлючЗаписи,ДатаЗагрузкиМС", КлючЗаписи, ДатаЗагрузкиМС);
	Возврат РегистрыСведений.кфкВходящиеСообщения.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

Процедура ПроверитьСтатус(Ключ, ОжидаемыйСтатус)
	
	Предикат = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Ключ.КлючЗаписи)
		.Реквизит("ДатаЗагрузкиМС").Равно(Ключ.ДатаЗагрузкиМС)
		.Реквизит("Статус").Равно(ОжидаемыйСтатус);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.СодержитЗаписи(Предикат);
	
КонецПроцедуры

Процедура ПроверитьОтсутствиеЗаписи(Ключ)
	
	Предикат = ЮТест.Предикат()
		.Реквизит("КлючЗаписи").Равно(Ключ.КлючЗаписи)
		.Реквизит("ДатаЗагрузкиМС").Равно(Ключ.ДатаЗагрузкиМС);
	
	ЮТест.ОжидаетЧтоТаблицаБазы("РегистрСведений.кфкВходящиеСообщения")
		.НеСодержитЗаписи(Предикат);
	
КонецПроцедуры
